In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('transactions.csv')
df

,Customer ID,Name,Surname,Gender,Birthdate,Transaction Amount,Date,Merchant Name,Category
0,752858,Sean,Rodriguez,F,20-10-2002,35.47,03-04-2023,Smith-Russell,Cosmetic
1,26381,Michelle,Phelps,NaN,24-10-1985,2552.72,17-07-2023,"Peck, Spence and Young",Travel
2,305449,Jacob,Williams,M,25-10-1981,115.97,20-09-2023,Steele Inc,Clothing
3,988259,Nathan,Snyder,M,26-10-1977,11.31,11-01-2023,"Wilson, Wilson and Russell",Cosmetic
4,764762,Crystal,Knapp,F,02-11-1951,62.21,13-06-2023,Palmer-Hinton,Electronics
...,...,...,...,...,...,...,...,...,...
13114,669328,Deborah,Gates,M,25-10-1982,36.68,28-09-2023,Sanchez PLC,Cosmetic
13115,711774,Jane,Franklin,F,26-10-1976,445.95,30-09-2023,"West, Norton and Brown",Market
13116,589071,Gary,Bender,M,31-10-1959,39.01,16-05-2023,"Williams, Payne and Mcdaniel",Restaurant
13117,74838,Michael,Valdez,F,20-10-2002,677.14,07-09-2023,"Miller, Ayala and Snyder",Electronics
13118,182266,Keith,Hart,F,02-11-1951,26.00,NaN,NaN,NaN

In [3]:
df_raw = df.copy()

In [4]:
df = df_raw.copy()

In [5]:
df.head()

,Customer ID,Name,Surname,Gender,Birthdate,Transaction Amount,Date,Merchant Name,Category
0,752858,Sean,Rodriguez,F,20-10-2002,35.47,03-04-2023,Smith-Russell,Cosmetic
1,26381,Michelle,Phelps,NaN,24-10-1985,2552.72,17-07-2023,"Peck, Spence and Young",Travel
2,305449,Jacob,Williams,M,25-10-1981,115.97,20-09-2023,Steele Inc,Clothing
3,988259,Nathan,Snyder,M,26-10-1977,11.31,11-01-2023,"Wilson, Wilson and Russell",Cosmetic
4,764762,Crystal,Knapp,F,02-11-1951,62.21,13-06-2023,Palmer-Hinton,Electronics

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13119 entries, 0 to 13118
Data columns (total 9 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Customer ID         13119 non-null  int64
 1   Name                13119 non-null  object
 2   Surname             13119 non-null  object
 3   Gender              11773 non-null  object
 4   Birthdate           13119 non-null  object
 5   Transaction Amount  13119 non-null  float64
 6   Date                13118 non-null  object
 7   Merchant Name       13118 non-null  object
 8   Category            13118 non-null  object
dtypes: float64(1), int64(1), object(7)
memory usage: 922.6+ KB

In [7]:
df.shape

(13119, 9)

In [8]:
df.isnull().sum()

Customer ID              0
Name                     0
Surname                  0
Gender                1346
Birthdate                0
Transaction Amount       0
Date                     1
Merchant Name            1
Category                 1
dtype: int64

In [9]:
df.columns = (
    df.columns
    .str.lower()
    .str.strip()
    .str.replace(' ', '_')
)

In [10]:
df

,customer_id,name,surname,gender,birthdate,transaction_amount,date,merchant_name,category
0,752858,Sean,Rodriguez,F,20-10-2002,35.47,03-04-2023,Smith-Russell,Cosmetic
1,26381,Michelle,Phelps,NaN,24-10-1985,2552.72,17-07-2023,"Peck, Spence and Young",Travel
2,305449,Jacob,Williams,M,25-10-1981,115.97,20-09-2023,Steele Inc,Clothing
3,988259,Nathan,Snyder,M,26-10-1977,11.31,11-01-2023,"Wilson, Wilson and Russell",Cosmetic
4,764762,Crystal,Knapp,F,02-11-1951,62.21,13-06-2023,Palmer-Hinton,Electronics
...,...,...,...,...,...,...,...,...,...
13114,669328,Deborah,Gates,M,25-10-1982,36.68,28-09-2023,Sanchez PLC,Cosmetic
13115,711774,Jane,Franklin,F,26-10-1976,445.95,30-09-2023,"West, Norton and Brown",Market
13116,589071,Gary,Bender,M,31-10-1959,39.01,16-05-2023,"Williams, Payne and Mcdaniel",Restaurant
13117,74838,Michael,Valdez,F,20-10-2002,677.14,07-09-2023,"Miller, Ayala and Snyder",Electronics
13118,182266,Keith,Hart,F,02-11-1951,26.00,NaN,NaN,NaN

In [11]:
df['gender'] = df['gender'].fillna('Unknown')
df

,customer_id,name,surname,gender,birthdate,transaction_amount,date,merchant_name,category
0,752858,Sean,Rodriguez,F,20-10-2002,35.47,03-04-2023,Smith-Russell,Cosmetic
1,26381,Michelle,Phelps,Unknown,24-10-1985,2552.72,17-07-2023,"Peck, Spence and Young",Travel
2,305449,Jacob,Williams,M,25-10-1981,115.97,20-09-2023,Steele Inc,Clothing
3,988259,Nathan,Snyder,M,26-10-1977,11.31,11-01-2023,"Wilson, Wilson and Russell",Cosmetic
4,764762,Crystal,Knapp,F,02-11-1951,62.21,13-06-2023,Palmer-Hinton,Electronics
...,...,...,...,...,...,...,...,...,...
13114,669328,Deborah,Gates,M,25-10-1982,36.68,28-09-2023,Sanchez PLC,Cosmetic
13115,711774,Jane,Franklin,F,26-10-1976,445.95,30-09-2023,"West, Norton and Brown",Market
13116,589071,Gary,Bender,M,31-10-1959,39.01,16-05-2023,"Williams, Payne and Mcdaniel",Restaurant
13117,74838,Michael,Valdez,F,20-10-2002,677.14,07-09-2023,"Miller, Ayala and Snyder",Electronics
13118,182266,Keith,Hart,F,02-11-1951,26.00,NaN,NaN,NaN

In [12]:
df.dropna(subset=['date', 'merchant_name', 'category'], inplace=True)
df

,customer_id,name,surname,gender,birthdate,transaction_amount,date,merchant_name,category
0,752858,Sean,Rodriguez,F,20-10-2002,35.47,03-04-2023,Smith-Russell,Cosmetic
1,26381,Michelle,Phelps,Unknown,24-10-1985,2552.72,17-07-2023,"Peck, Spence and Young",Travel
2,305449,Jacob,Williams,M,25-10-1981,115.97,20-09-2023,Steele Inc,Clothing
3,988259,Nathan,Snyder,M,26-10-1977,11.31,11-01-2023,"Wilson, Wilson and Russell",Cosmetic
4,764762,Crystal,Knapp,F,02-11-1951,62.21,13-06-2023,Palmer-Hinton,Electronics
...,...,...,...,...,...,...,...,...,...
13113,61468,Lisa,Moore,M,30-10-1962,480.37,04-03-2023,Wilson LLC,Market
13114,669328,Deborah,Gates,M,25-10-1982,36.68,28-09-2023,Sanchez PLC,Cosmetic
13115,711774,Jane,Franklin,F,26-10-1976,445.95,30-09-2023,"West, Norton and Brown",Market
13116,589071,Gary,Bender,M,31-10-1959,39.01,16-05-2023,"Williams, Payne and Mcdaniel",Restaurant
13117,74838,Michael,Valdez,F,20-10-2002,677.14,07-09-2023,"Miller, Ayala and Snyder",Electronics

In [13]:
df['birthdate'] = pd.to_datetime(
    df['birthdate'], format='%d-%m-%Y', errors='coerce'
)

df['date'] = pd.to_datetime(df['date'], errors='coerce')
df

,customer_id,name,surname,gender,birthdate,transaction_amount,date,merchant_name,category
0,752858,Sean,Rodriguez,F,2002-10-20,35.47,2023-03-04,Smith-Russell,Cosmetic
1,26381,Michelle,Phelps,Unknown,1985-10-24,2552.72,NaT,"Peck, Spence and Young",Travel
2,305449,Jacob,Williams,M,1981-10-25,115.97,NaT,Steele Inc,Clothing
3,988259,Nathan,Snyder,M,1977-10-26,11.31,2023-11-01,"Wilson, Wilson and Russell",Cosmetic
4,764762,Crystal,Knapp,F,1951-11-02,62.21,NaT,Palmer-Hinton,Electronics
...,...,...,...,...,...,...,...,...,...
13113,61468,Lisa,Moore,M,1962-10-30,480.37,2023-04-03,Wilson LLC,Market
13114,669328,Deborah,Gates,M,1982-10-25,36.68,NaT,Sanchez PLC,Cosmetic
13115,711774,Jane,Franklin,F,1976-10-26,445.95,NaT,"West, Norton and Brown",Market
13116,589071,Gary,Bender,M,1959-10-31,39.01,NaT,"Williams, Payne and Mcdaniel",Restaurant
13117,74838,Michael,Valdez,F,2002-10-20,677.14,2023-07-09,"Miller, Ayala and Snyder",Electronics

In [16]:
df['birthdate'] = pd.to_datetime(
    df['birthdate'], format='%d-%m-%Y', errors='coerce'
)

df['date'] = pd.to_datetime(df['date'], errors='coerce')
df

,customer_id,name,surname,gender,birthdate,transaction_amount,date,merchant_name,category
0,752858,Sean,Rodriguez,F,2002-10-20,35.47,2023-03-04,Smith-Russell,Cosmetic
1,26381,Michelle,Phelps,Unknown,1985-10-24,2552.72,NaT,"Peck, Spence and Young",Travel
2,305449,Jacob,Williams,M,1981-10-25,115.97,NaT,Steele Inc,Clothing
3,988259,Nathan,Snyder,M,1977-10-26,11.31,2023-11-01,"Wilson, Wilson and Russell",Cosmetic
4,764762,Crystal,Knapp,F,1951-11-02,62.21,NaT,Palmer-Hinton,Electronics
...,...,...,...,...,...,...,...,...,...
13113,61468,Lisa,Moore,M,1962-10-30,480.37,2023-04-03,Wilson LLC,Market
13114,669328,Deborah,Gates,M,1982-10-25,36.68,NaT,Sanchez PLC,Cosmetic
13115,711774,Jane,Franklin,F,1976-10-26,445.95,NaT,"West, Norton and Brown",Market
13116,589071,Gary,Bender,M,1959-10-31,39.01,NaT,"Williams, Payne and Mcdaniel",Restaurant
13117,74838,Michael,Valdez,F,2002-10-20,677.14,2023-07-09,"Miller, Ayala and Snyder",Electronics

In [17]:
df ['date'] = df_raw['Date']

In [18]:
df

,customer_id,name,surname,gender,birthdate,transaction_amount,date,merchant_name,category
0,752858,Sean,Rodriguez,F,2002-10-20,35.47,03-04-2023,Smith-Russell,Cosmetic
1,26381,Michelle,Phelps,Unknown,1985-10-24,2552.72,17-07-2023,"Peck, Spence and Young",Travel
2,305449,Jacob,Williams,M,1981-10-25,115.97,20-09-2023,Steele Inc,Clothing
3,988259,Nathan,Snyder,M,1977-10-26,11.31,11-01-2023,"Wilson, Wilson and Russell",Cosmetic
4,764762,Crystal,Knapp,F,1951-11-02,62.21,13-06-2023,Palmer-Hinton,Electronics
...,...,...,...,...,...,...,...,...,...
13113,61468,Lisa,Moore,M,1962-10-30,480.37,04-03-2023,Wilson LLC,Market
13114,669328,Deborah,Gates,M,1982-10-25,36.68,28-09-2023,Sanchez PLC,Cosmetic
13115,711774,Jane,Franklin,F,1976-10-26,445.95,30-09-2023,"West, Norton and Brown",Market
13116,589071,Gary,Bender,M,1959-10-31,39.01,16-05-2023,"Williams, Payne and Mcdaniel",Restaurant
13117,74838,Michael,Valdez,F,2002-10-20,677.14,07-09-2023,"Miller, Ayala and Snyder",Electronics

In [19]:
df['date'] = pd.to_datetime(df['date'], errors='coerce', dayfirst=True)
df

,customer_id,name,surname,gender,birthdate,transaction_amount,date,merchant_name,category
0,752858,Sean,Rodriguez,F,2002-10-20,35.47,2023-04-03,Smith-Russell,Cosmetic
1,26381,Michelle,Phelps,Unknown,1985-10-24,2552.72,2023-07-17,"Peck, Spence and Young",Travel
2,305449,Jacob,Williams,M,1981-10-25,115.97,2023-09-20,Steele Inc,Clothing
3,988259,Nathan,Snyder,M,1977-10-26,11.31,2023-01-11,"Wilson, Wilson and Russell",Cosmetic
4,764762,Crystal,Knapp,F,1951-11-02,62.21,2023-06-13,Palmer-Hinton,Electronics
...,...,...,...,...,...,...,...,...,...
13113,61468,Lisa,Moore,M,1962-10-30,480.37,2023-03-04,Wilson LLC,Market
13114,669328,Deborah,Gates,M,1982-10-25,36.68,2023-09-28,Sanchez PLC,Cosmetic
13115,711774,Jane,Franklin,F,1976-10-26,445.95,2023-09-30,"West, Norton and Brown",Market
13116,589071,Gary,Bender,M,1959-10-31,39.01,2023-05-16,"Williams, Payne and Mcdaniel",Restaurant
13117,74838,Michael,Valdez,F,2002-10-20,677.14,2023-09-07,"Miller, Ayala and Snyder",Electronics

In [20]:
df.dropna(subset=['birthdate', 'date'], inplace=True)
df

,customer_id,name,surname,gender,birthdate,transaction_amount,date,merchant_name,category
0,752858,Sean,Rodriguez,F,2002-10-20,35.47,2023-04-03,Smith-Russell,Cosmetic
1,26381,Michelle,Phelps,Unknown,1985-10-24,2552.72,2023-07-17,"Peck, Spence and Young",Travel
2,305449,Jacob,Williams,M,1981-10-25,115.97,2023-09-20,Steele Inc,Clothing
3,988259,Nathan,Snyder,M,1977-10-26,11.31,2023-01-11,"Wilson, Wilson and Russell",Cosmetic
4,764762,Crystal,Knapp,F,1951-11-02,62.21,2023-06-13,Palmer-Hinton,Electronics
...,...,...,...,...,...,...,...,...,...
13113,61468,Lisa,Moore,M,1962-10-30,480.37,2023-03-04,Wilson LLC,Market
13114,669328,Deborah,Gates,M,1982-10-25,36.68,2023-09-28,Sanchez PLC,Cosmetic
13115,711774,Jane,Franklin,F,1976-10-26,445.95,2023-09-30,"West, Norton and Brown",Market
13116,589071,Gary,Bender,M,1959-10-31,39.01,2023-05-16,"Williams, Payne and Mcdaniel",Restaurant
13117,74838,Michael,Valdez,F,2002-10-20,677.14,2023-09-07,"Miller, Ayala and Snyder",Electronics

In [21]:
df['transaction_amount'] = pd.to_numeric(
    df['transaction_amount'], errors='coerce'
)

df = df[df['transaction_amount'] > 0]

In [22]:
df

,customer_id,name,surname,gender,birthdate,transaction_amount,date,merchant_name,category
0,752858,Sean,Rodriguez,F,2002-10-20,35.47,2023-04-03,Smith-Russell,Cosmetic
1,26381,Michelle,Phelps,Unknown,1985-10-24,2552.72,2023-07-17,"Peck, Spence and Young",Travel
2,305449,Jacob,Williams,M,1981-10-25,115.97,2023-09-20,Steele Inc,Clothing
3,988259,Nathan,Snyder,M,1977-10-26,11.31,2023-01-11,"Wilson, Wilson and Russell",Cosmetic
4,764762,Crystal,Knapp,F,1951-11-02,62.21,2023-06-13,Palmer-Hinton,Electronics
...,...,...,...,...,...,...,...,...,...
13113,61468,Lisa,Moore,M,1962-10-30,480.37,2023-03-04,Wilson LLC,Market
13114,669328,Deborah,Gates,M,1982-10-25,36.68,2023-09-28,Sanchez PLC,Cosmetic
13115,711774,Jane,Franklin,F,1976-10-26,445.95,2023-09-30,"West, Norton and Brown",Market
13116,589071,Gary,Bender,M,1959-10-31,39.01,2023-05-16,"Williams, Payne and Mcdaniel",Restaurant
13117,74838,Michael,Valdez,F,2002-10-20,677.14,2023-09-07,"Miller, Ayala and Snyder",Electronics

In [23]:
df.duplicated().sum()

0

In [24]:
text_cols = ['name', 'surname', 'merchant_name', 'category']

for col in text_cols:
    df[col] = df[col].str.strip().str.title()
df

,customer_id,name,surname,gender,birthdate,transaction_amount,date,merchant_name,category
0,752858,Sean,Rodriguez,F,2002-10-20,35.47,2023-04-03,Smith-Russell,Cosmetic
1,26381,Michelle,Phelps,Unknown,1985-10-24,2552.72,2023-07-17,"Peck, Spence And Young",Travel
2,305449,Jacob,Williams,M,1981-10-25,115.97,2023-09-20,Steele Inc,Clothing
3,988259,Nathan,Snyder,M,1977-10-26,11.31,2023-01-11,"Wilson, Wilson And Russell",Cosmetic
4,764762,Crystal,Knapp,F,1951-11-02,62.21,2023-06-13,Palmer-Hinton,Electronics
...,...,...,...,...,...,...,...,...,...
13113,61468,Lisa,Moore,M,1962-10-30,480.37,2023-03-04,Wilson Llc,Market
13114,669328,Deborah,Gates,M,1982-10-25,36.68,2023-09-28,Sanchez Plc,Cosmetic
13115,711774,Jane,Franklin,F,1976-10-26,445.95,2023-09-30,"West, Norton And Brown",Market
13116,589071,Gary,Bender,M,1959-10-31,39.01,2023-05-16,"Williams, Payne And Mcdaniel",Restaurant
13117,74838,Michael,Valdez,F,2002-10-20,677.14,2023-09-07,"Miller, Ayala And Snyder",Electronics

In [26]:
df['year'] = df['date'].dt.year
df['month'] = df['date'].dt.month_name()
df['day_name'] = df['date'].dt.day_name()
df

,customer_id,name,surname,gender,birthdate,transaction_amount,date,merchant_name,category,year,month,day_name
0,752858,Sean,Rodriguez,F,2002-10-20,35.47,2023-04-03,Smith-Russell,Cosmetic,2023,April,Monday
1,26381,Michelle,Phelps,Unknown,1985-10-24,2552.72,2023-07-17,"Peck, Spence And Young",Travel,2023,July,Monday
2,305449,Jacob,Williams,M,1981-10-25,115.97,2023-09-20,Steele Inc,Clothing,2023,September,Wednesday
3,988259,Nathan,Snyder,M,1977-10-26,11.31,2023-01-11,"Wilson, Wilson And Russell",Cosmetic,2023,January,Wednesday
4,764762,Crystal,Knapp,F,1951-11-02,62.21,2023-06-13,Palmer-Hinton,Electronics,2023,June,Tuesday
...,...,...,...,...,...,...,...,...,...,...,...,...
13113,61468,Lisa,Moore,M,1962-10-30,480.37,2023-03-04,Wilson Llc,Market,2023,March,Saturday
13114,669328,Deborah,Gates,M,1982-10-25,36.68,2023-09-28,Sanchez Plc,Cosmetic,2023,September,Thursday
13115,711774,Jane,Franklin,F,1976-10-26,445.95,2023-09-30,"West, Norton And Brown",Market,2023,September,Saturday
13116,589071,Gary,Bender,M,1959-10-31,39.01,2023-05-16,"Williams, Payne And Mcdaniel",Restaurant,2023,May,Tuesday
13117,74838,Michael,Valdez,F,2002-10-20,677.14,2023-09-07,"Miller, Ayala And Snyder",Electronics,2023,September,Thursday

In [27]:
df['age'] = (df['date'] - df['birthdate']).dt.days // 365
df

,customer_id,name,surname,gender,birthdate,transaction_amount,date,merchant_name,category,year,month,day_name,age
0,752858,Sean,Rodriguez,F,2002-10-20,35.47,2023-04-03,Smith-Russell,Cosmetic,2023,April,Monday,20
1,26381,Michelle,Phelps,Unknown,1985-10-24,2552.72,2023-07-17,"Peck, Spence And Young",Travel,2023,July,Monday,37
2,305449,Jacob,Williams,M,1981-10-25,115.97,2023-09-20,Steele Inc,Clothing,2023,September,Wednesday,41
3,988259,Nathan,Snyder,M,1977-10-26,11.31,2023-01-11,"Wilson, Wilson And Russell",Cosmetic,2023,January,Wednesday,45
4,764762,Crystal,Knapp,F,1951-11-02,62.21,2023-06-13,Palmer-Hinton,Electronics,2023,June,Tuesday,71
...,...,...,...,...,...,...,...,...,...,...,...,...,...
13113,61468,Lisa,Moore,M,1962-10-30,480.37,2023-03-04,Wilson Llc,Market,2023,March,Saturday,60
13114,669328,Deborah,Gates,M,1982-10-25,36.68,2023-09-28,Sanchez Plc,Cosmetic,2023,September,Thursday,40
13115,711774,Jane,Franklin,F,1976-10-26,445.95,2023-09-30,"West, Norton And Brown",Market,2023,September,Saturday,46
13116,589071,Gary,Bender,M,1959-10-31,39.01,2023-05-16,"Williams, Payne And Mcdaniel",Restaurant,2023,May,Tuesday,63
13117,74838,Michael,Valdez,F,2002-10-20,677.14,2023-09-07,"Miller, Ayala And Snyder",Electronics,2023,September,Thursday,20

In [28]:
df = df[(df['age'] >= 18) & (df['age'] <= 100)]
df

,customer_id,name,surname,gender,birthdate,transaction_amount,date,merchant_name,category,year,month,day_name,age
0,752858,Sean,Rodriguez,F,2002-10-20,35.47,2023-04-03,Smith-Russell,Cosmetic,2023,April,Monday,20
1,26381,Michelle,Phelps,Unknown,1985-10-24,2552.72,2023-07-17,"Peck, Spence And Young",Travel,2023,July,Monday,37
2,305449,Jacob,Williams,M,1981-10-25,115.97,2023-09-20,Steele Inc,Clothing,2023,September,Wednesday,41
3,988259,Nathan,Snyder,M,1977-10-26,11.31,2023-01-11,"Wilson, Wilson And Russell",Cosmetic,2023,January,Wednesday,45
4,764762,Crystal,Knapp,F,1951-11-02,62.21,2023-06-13,Palmer-Hinton,Electronics,2023,June,Tuesday,71
...,...,...,...,...,...,...,...,...,...,...,...,...,...
13113,61468,Lisa,Moore,M,1962-10-30,480.37,2023-03-04,Wilson Llc,Market,2023,March,Saturday,60
13114,669328,Deborah,Gates,M,1982-10-25,36.68,2023-09-28,Sanchez Plc,Cosmetic,2023,September,Thursday,40
13115,711774,Jane,Franklin,F,1976-10-26,445.95,2023-09-30,"West, Norton And Brown",Market,2023,September,Saturday,46
13116,589071,Gary,Bender,M,1959-10-31,39.01,2023-05-16,"Williams, Payne And Mcdaniel",Restaurant,2023,May,Tuesday,63
13117,74838,Michael,Valdez,F,2002-10-20,677.14,2023-09-07,"Miller, Ayala And Snyder",Electronics,2023,September,Thursday,20

In [29]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 12874 entries, 0 to 13117
Data columns (total 13 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   customer_id         12874 non-null  int64
 1   name                12874 non-null  object
 2   surname             12874 non-null  object
 3   gender              12874 non-null  object
 4   birthdate           12874 non-null  datetime64[ns]
 5   transaction_amount  12874 non-null  float64
 6   date                12874 non-null  datetime64[ns]
 7   merchant_name       12874 non-null  object
 8   category            12874 non-null  object
 9   year                12874 non-null  int32
 10  month               12874 non-null  object
 11  day_name            12874 non-null  object
 12  age                 12874 non-null  int64
dtypes: datetime64[ns](2), float64(1), int32(1), int64(2), object(7)
memory usage: 1.3+ MB

In [30]:
df.isnull().sum()

customer_id           0
name                  0
surname               0
gender                0
birthdate             0
transaction_amount    0
date                  0
merchant_name         0
category              0
year                  0
month                 0
day_name              0
age                   0
dtype: int64

In [31]:
df.describe()

,customer_id,birthdate,transaction_amount,date,year,age
count,12874.000000,12874,12874.000000,12874,12874.0,12874.000000
mean,498307.524468,1976-07-24 17:20:54.435295968,441.782520,2023-05-22 17:59:29.799596288,2023.0,46.255554
min,29.000000,1948-11-02 00:00:00,5.220000,2023-01-01 00:00:00,2023.0,18.000000
25%,248389.000000,1961-10-30 00:00:00,78.382500,2023-03-10 00:00:00,2023.0,32.000000
50%,498369.000000,1976-10-26 00:00:00,182.280000,2023-05-22 00:00:00,2023.0,46.000000
75%,742676.500000,1990-10-23 00:00:00,468.080000,2023-08-04 00:00:00,2023.0,61.000000
max,999997.000000,2004-10-19 00:00:00,2996.850000,2023-10-14 00:00:00,2023.0,74.000000
std,287407.674638,NaN,630.194038,NaN,0.0,16.601781

In [32]:
df.to_csv('cleaned_credit_card_transactions.csv', index=False)